#Программа забавные строки
#Всякие сцепления и повторения строк
print("Две строки можно сцепить " + "при помощи оператора '+'.")
print("\nЭта строка" + "вряд ли" + "удив" + "ит вас. " \
      + "Но инетерсно, " + "что" + " она - \n" + "одна длинная-длин" \
      + "на" + "я" + " строка. Сцепленная " \
      + "из", "двадцати двух\n" + "отдельных строк. Разбитых " \
      + "на шесть строк." + " Достаточно ли вы" + " впечатлены? " + "Ну хватит!\n" \
      + "Вот " + "наша " + "длинная" + " строка и закончилась!")
print("""\nЕсли текст нравится. Его можно и повторить. К примеру,
кто не любит пончики? Только дураки не любят пирожных. А 
раз мы люди честные, то выскажемся о своих симпатиях
откровенно:""")
print("Пенисы" * 10)
input("\n\nНажмите Enter, чтобы выйти.")