#код для escape последовательностей
#ого-го какие тут блин штуки уже серъезные происходят (дальше вообщезакачаешься)

print("\t\t\tВоброжаемые благодарности")
print("\t\t\t \ \ \ \ \ \ \ \ \ \ \ \ ")
print("\t\t\tРазработчика игры")
print("\t\t\tГлебасты Жемчуга")
print("\t\t\t \ \ \ \ \ \ \ \ \ \ \ \ ")
print("\nОтдельное спасибо хотелось бы сказать:")
print("моему псу \'ЧОПУ\' за то, что сгрыз все мои \"провода\" от наушников")

#тут какой-то звук динамика, но я еще не запускал программу, так что хз ещё)
#запустил я программу, но звук динамика почему то не работает, надо бы узнать...

print("\a")
